Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: If you’re passing a generator that results in the same sequence of floating-point values each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じ浮動小数点値からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re passing a generator that results in the same sequence of integer values each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じ整数値からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re passing a generator that results in the same shuffled order each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じシャッフルされた順番という結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re sure of the dynamic type of obj, you can call getIntegerValue() directly.
ja: あなたがobjの動的型に確信を持つならば、あなたはgetIntegerValue()を直接に呼び出すこともできます。

source: If you’re working directly with numeric values, use the addition operator (+) instead of this method.
ja: あなたが直接に数値を扱っているならば、加算演算子（+）をこのメソッドの代わりに使ってください。

source: Imagine you have a set of temperature data for which you need to report some general statistics: the total number of observations, the number of valid observations, and the average temperature.
ja: あなたが幾つかの一般統計：観測総数、有効観測数、そして平均温度を報告しなければならない一揃いの温度データを持つと想像してください。

source: Implement this method to conform to the Hashable protocol.
ja: このメソッドを実装して、Hashableプロトコルに準拠してください。

source: Implementing next() with a withTaskCancellationHandler(handler:operation:) invocation to immediately react to cancellation.
ja: next()をあるwithTaskCancellationHandler(handler:operation:)発動をつかって実装して、直接に取り消しに反応を示す。

source: Import Code Within a Framework Target
ja: フレームワークターゲット内部でコードをインポートする

source: Import Code Within an App Target
ja: アプリターゲット内部でコードをインポートする

source: Import Swift code into Objective-C within the same framework:
ja: SwiftコードをObjective-Cへと同じフレームワーク内部でインポートする：

source: Import the Swift code from that framework target into any Objective-C .m file within that target using this syntax and substituting the appropriate names:
ja: そのフレームワークターゲットからのSwiftコードを何らかのObjective-C .mファイルにそのターゲット内部で、この構文を使ってそして適切な名前で置き換えて、インポートしてください：

source: Import your Objective-C headers into an Objective-C bridging header file to expose the declarations to all your Swift files.
ja: あなたのObjective-CヘッダをObjective-Cブリッジヘッダファイルにインポートして、それら宣言をあなたのSwiftファイルすべてに露出してください。

source: Important
ja: 重要

source: Imported C and Objective-C APIs
ja: インポートされたCおよびObjective-C API

source: Importing Objective-C into Swift
ja: Objective-CをSwiftにインポートする

source: Importing Swift into Objective-C
ja: SwiftをObjective-Cにインポートする

source: In -O builds, has no effect.
ja: -Oビルドでは、影響はありません。

source: In -O builds, no test is performed to ensure that x actually has the dynamic type T.
ja: -Oビルドにおいて、全くテストは実行されずxが実際に動的型Tを持つことを保証されません。

source: In -Ounchecked builds, the optimizer may assume that this function is never called.
ja: -Ouncheckedビルドでは、最適化はこの関数が決して呼ばれないと決めてかかります。

source: In -O builds (the default for Xcode’s Release configuration), condition is not evaluated, and there are no effects.
ja: -Oビルド（省略時のXcodeのRelease構成）では、conditionは評価されません、そして影響はありません。

source: In -O builds (the default for Xcode’s Release configuration), stops program execution.
ja: -Oビルド（XcodeのRelease構成の初期設定）では、プログラム実行を停止します。

source: In -O builds (the default for Xcode’s Release configuration): If condition evaluates to false, stop program execution.
ja: -Oビルド（省略時のXcodeのRelease構成）では：conditionがfalseに評価されるならば、プログラム実行を止めます。

source: In -Ounchecked builds, condition is not evaluated, but the optimizer may assume that it always evaluates to true.
ja: -Ouncheckedビルドにおいて、conditionは評価されません、しかし最適化は、それがtrueに常にに評価されると決めてかかります。

source: In Build Settings, in Swift Compiler - General, make sure the Objective-C Bridging Header build setting has a path to the bridging header file.
ja: Build Settingsでは、Swift Compiler - Generalにおいて、Objective-C Bridging Header ビルド設定がブリッジヘッダファイルに対するパスを持つことを確実にしてください。

source: In Cocoa, methods that perform asynchronous operations take a completion handler as their last parameter, and the method calls that block after the operation finishes to return a result or an error.
ja: Cocoaでは、非同期演算を実行するメソッドは、それの最後のパラメータとしてある完了ハンドラを、そして演算が終了する後では遮断するメソッド呼び出しいくつかをとって、結果またはエラーを返します。

source: In Cocoa, methods that produce errors take an NSError pointer parameter as their last parameter, which populates its argument with an NSError object if an error occurs.
ja: Cocoaでは、エラーを生成するメソッドはNSErrorポインタパラメータをそれらの最後のパラメータとして取ります、エラーが発生するならばその引数にNSErrorオブジェクトが入ります。

source: In Objective-C, exceptions are distinct from errors.
ja: Objective-Cにおいて、例外はエラーとは別個のものです。

source: In Objective-C, it's declared like this:
ja: Objective-Cでは、それはこのように宣言されます：

source: In Objective-C, the id type represents objects that are instances of any Objective-C class.
ja: Objective-Cでは、id型は、何らかのObjective-Cクラスのインスタンスであるオブジェクトを表します。

source: In Swift it‘s imported as two methods, an asychronous method that takes a closure and an asynchronous throwing method that returns a tuple:
ja: Swiftではそれは２つのメソッドとしてインポートされます、あるクロージャをとる非同期メソッドそしてあるタプルを返す非同期スローメソッド：

source: In Swift, calling a method that throws requires explicit error handling.
ja: スウィフトでは、スローするメソッドを呼び出すことは明確にエラー処理することを必要とします。

source: In Swift, it’s imported like this:
ja: スウィフトでは、それはこのようにインポートされます：

source: In Swift, you can call C variadic functions, such as vasprintf(_:_:_:), using the Swift getVaList(_:) or withVaList(_:_:) functions.
ja: Swiftでは、あなたはC可変長引数関数、例えばvasprintf(_:_:_:)などを呼び出すことが、SwiftのgetVaList(_:)またはwithVaList(_:_:)関数を使って可能です。

source: In Swift, you can recover from errors passed using Cocoa’s error pattern, as described above in Catch Errors.
ja: Swiftでは、あなたはCocoaのエラーパターンを使って渡されるエラーから復旧できます、上のエラーをキャッチするで記述されるように。

source: In Swift, you can use each pair of toll-free bridged Foundation and Core Foundation types interchangeably.
ja: スウィフトにおいて、あなたは、トールフリーブリッジ（無料の橋渡し）されたFoundationとCore Foundation型の各対を入れ替えて使うことができます。

source: In Swift, you can use functions and generics to achieve the same results without any compromises.
ja: スウィフトでは、あなたはどんな妥協もなしで同じ結果を成し遂げるために、関数と総称体を使用することができます。

source: In a CollectionOfOne instance, endIndex is always 1.
ja: CollectionOfOneインスタンスにおいて、endIndexは常に1です。

source: In a CollectionOfOne instance, startIndex is always 0.
ja: あるCollectionOfOneインスタンスにおいて、startIndexは常に0です。

source: In a case like this, where a generic parameter T is bound to a protocol P, the type parameter is not statically known to be a protocol type in the body of the generic function.
ja: このような場合において、総称体パラメータTがプロトコルPに束縛されるところでは、その型パラメータは、プロトコル型であることを総称体関数の本文において静的に知られません。

source: In a collection, the subsequence should also conform to Collection.
ja: あるコレクションにおいて、下位シーケンスはまたCollectionに準拠すべきです。

source: In a mutable Dictionary instance, you can modify in place a value that you’ve accessed through a keyed subscript.
ja: 可変のDictionaryインスタンスでは、あなたがキーによる添え字を通してアクセスしたある値をその場で修正できます。

source: In addition to creating a character from a single-character string literal, you can also convert a unicode scalar value or single-character string.
ja: ある文字を単一文字文字列リテラルから作成することに加えて、あなたはまた、あるユニコードスカラー値や単一文字文字列を変換できます。

source: In addition to representing specific numbers, floating-point types also have special values for working with overflow and nonnumeric results of calculation.
ja: 特定の数を表すことに加えて、浮動小数点型はまた、オーバーフローおよび非数の計算結果で使うための特別な値を持ちます。

source: In addition to simplifying your code, this automatic conformance reduces errors, because any new properties you add to your custom types are automatically included when hashing and testing for equality.
ja: あなたのコードを単純にすることに加えて、この自動式の準拠はエラーを減らします、なぜならあなたのあつらえの型にあなたが加える何らかの新しいプロパティは、ハッシュ化および同等性テストをする場合に自動的に含まれるからです。

source: In addition to the operations that collections inherit from the Sequence protocol, you gain access to methods that depend on accessing an element at a specific position in a collection.
ja: コレクションがSequenceプロトコルから継承するメソッドに加えて、あなたは、コレクションの特定の位置で要素にアクセスすることを当てにするメソッドへの利用権を手に入れます。

source: In addition to using a dictionary literal, you can also create a dictionary using these initializers.
ja: 辞書リテラルを使うことに加えて、あなたはまた辞書をこれらのイニシャライザを使って作成できます。

source: In addition to using an array literal, you can also create an array using these initializers.
ja: 配列リテラルを使うことに加えて、あなたはまた配列をこれらのイニシャライザを使って作成できます。

source: In addition, because abs(_:) always returns a value of the same type, even in a generic context, using the function instead of the magnitude property is encouraged.
ja: 加えて、abs(_:)は常に同じ型の値を返すことから、総称体の文脈においてさえも、この関数をmagnitudeプロパティの代わりに使うことは推奨されます。

source: In addition, because IntegerRef conforms to the Equatable protocol, instances can also be compared using the equal-to operator (==).
ja: 加えて、IntegerRefはEquatableプロトコルに準拠することから、インスタンスはまた同等性演算子（==）を使って比較されることもできます。

source: In addition, bidirectional collections have more efficient implementations of some sequence and collection methods, such as suffix(_:).
ja: さらに加えて、二方向性のコレクションはいくらかのシーケンスおよびコレクションメソッドのもっと手際の良い実装を持ちます、例えばsuffix(_:)など。

source: In addition, the following conditions must hold:
ja: 加えて、以下の条件が保持されなければなりません：

source: In addition, the unqualified listOfObjects method uses the NSCopying generic constraint inferred from the List type.
ja: 加えて、不適格listOfObjectsメソッドは、NSCopying総称体制約をList型から推論されて使用します。

source: In addition, there are two other edge cases:
ja: 加えて、２つの別の境界事例があります：

source: In an app that consults a remote database, for example, an instance's identity may be fully owned by an external entity and communicated by an identifier.
ja: 例えば、リモートデータベースに助言を求めるアプリでは、あるインスタンスの持つ同一性は、外部存在によって完全に所有され、そしてある識別子によって伝えられるかもしれません。

source: In an empty collection, startIndex == endIndex.
ja: 空のコレクションでは、startIndex == endIndex。

source: In cases like this, the simplest fix is often to simply remove the call to reserveCapacity(_:), and let the append(_:) method grow the array for you.
ja: このような場合に、最も簡単な修正はしばしば単純にreserveCapacity(_:)の呼出しを取り除いて、そしてappend(_:)メソッドがあなたの代わりの配列を成長させるようにしてください。

source: In contrast, this example throws SomeError and cancels all of the tasks in the group:
ja: 対照的に、この例はSomeErrorをスローします、そしてそのグループの中の全てのタスクを取り消します：

source: In debug builds, an instance in the left-hand side of a && or || expression may still be referenced when evaluating the right-hand side, inflating the instance’s reference count.
ja: デバッグビルドにおいて、&&または||式の左手側でのインスタンスは、右手側を評価している時に依然として参照されるかもしれません、インスタンスのもつ参照カウントを上昇させながら。

source: In fact, s.flatMap(transform) is equivalent to Array(s.map(transform).joined()).
ja: 実際のところ、s.flatMap(transform)はArray(s.map(transform).joined())に等しいです。

source: In most cases, you should use the equal-to operator (==) to test whether two instances are equal.
ja: ほとんどの場合、あなたは同等演算子（==）を使って２つのインスタンスが等しいかどうかをテストするべきです。

source: In most cases, you won't need to modify this setting.
ja: ほとんどの場合では、あなたはこの設定を修正する必要はないでしょう。

source: In other languages, similar data types are known as hashes or associated arrays.
ja: 他の言語では、同じようなデータ型はハッシュまたは連想配列として知られます。

source: In other words, for ordinary sequences s:
ja: 言い換えれば、よくあるシーケンス sに対して：

source: In particular, x.sign == .minus if x is -0, and while x < 0 is always false if x is NaN, x.sign could be either .plus or .minus.
ja: とりわけ、xが-0ならばx.sign == .minus、一方でxがNaNならば、x.signが.plusまたは.minusのどちらでも、x < 0は常にfalseです。

source: In particular, negating a signed, fixed-width integer type’s minimum results in a value that cannot be represented.
ja: とりわけ、符号付きの、固定長整数型のもつ最小値を負にすることは、表現できない値という結果になります。

source: In particular, note that j, the index of the second day with absences, was found in a slice of the original array and then used to access a value in the original absences array itself.
ja: 特に、欠席者のいる第２の日付のインデックス、jが、オリジナル配列のひとつのスライス上で捜されて、それから値のアクセスのためにオリジナルのabsences配列自身において使われる点に注意してください。

source: In particular, passing NaN as other always results in nil.
ja: とりわけ、NaNをotherとして渡すことは常にnilの結果となります。

source: In particular, that slice, unlike an array, may have a nonzero startIndex and an endIndex that is not equal to count.
ja: 特に、そのスライスは、配列と違い、非ゼロのstartIndexとcountに等しくないendIndexを持つかもしれません。

source: In particular, the absolute value of a signed, fixed-width integer type’s minimum cannot be represented.
ja: とりわけ、符号付きの、固定長整数型のもつ極小は、表現されることは可能ではありません。

source: In particular, this discussion mentions extended grapheme clusters and Unicode scalar values.
ja: とりわけ、この解説は拡張書記素クラスタとユニコードスカラー値について言及します。

source: In playgrounds and -Onone builds (the default for Xcode’s Debug configuration), stop program execution in a debuggable state after printing message.
ja: プレイグラウンドおよび-Ononeビルド（省略時のXcodeのDebug構成）では、messageを出力した後にデバッグ可能状態でプログラム実行を停止します。

source: In playgrounds and -Onone builds (the default for Xcode’s Debug configuration), stops program execution in a debuggable state after printing message.
ja: プレイグラウンドおよび-Ononeビルド（XcodeのDebug構成の初期設定）では、messageを出力した後デバッグ可能な状態でプログラム実行を停止します。

source: In playgrounds and -Onone builds (the default for Xcode’s Debug configuration): If condition evaluates to false, stop program execution in a debuggable state after printing message.
ja: プレイグラウンドおよび-Ononeビルド（省略時のXcodeのDebug構成）において：conditionがfalseに評価されるならば、messageを出力した後にデバッグ可能状態でプログラム実行を停止します。

source: In short, the iterator is what produces the asynchronous sequence’s values.
ja: 要約すれば、そのイテレータは、非同期シーケンスのもつ値それらを取り出すものです。

source: In some uses, such as in a class initializer, you may find that the language rules do not allow you to use withVaList(_:_:) as intended.
ja: いくらの利用では、例えばclassでのように、あなたは言語規則があなたにwithVaList(_:_:)を意図したように利用させないのを発見するでしょう。

source: In that case, the default value and key are not written back to the dictionary after an operation.
ja: その場合には、省略時の値とキーは、演算の後に辞書へと書き戻されません。

source: In that case, the method returns nil.
ja: その場合には、このメソッドはnilを返します。

source: In the Zip2Sequence instance returned by this function, the elements of the ith pair are the ith elements of each underlying sequence.
ja: この関数によって返されるZip2Sequenceインスタンスにおいて、i番目の対の要素らは、基盤となる各シーケンスのi番目の要素らです。

source: In the hash(into:) method, call the combine(_:) method on the provided hasher with each significant property:
ja: hash(into:)メソッドにおいて、combine(_:)メソッドをその提供されたhasher上で各重要プロパティとともに呼び出してください：

source: In the example above, moreNumbers has the same type as numbers, which is [Int].
ja: 上の例において、moreNumbersはnumbersと同じ型を持ちます、それは[Int]です。

source: In the example above, firstSpace is used to extract the prefix that contains elements up to that index.
ja: 上の例において、firstSpaceは、そのインデックスまでの要素を含んでいる前の部分を抜き取るために使われます。

source: In the example below, jsonResponse contains an encoded PenPalRecord instance from a server:
ja: 下の例において、jsonResponseは、あるサーバからのエンコード済みPenPalRecordインスタンスを含みます。

source: In the example below, a numbers array is created along with two copies that share the same storage.
ja: 下の例において、numbers配列は２つのコピーと連れだって作成されます、それは同じストレージを共有します。

source: In the example below, changing the value of the isAlive computed property on an instance of the SchroedingersCat structure also changes the value of the instance’s isDead computed property:
ja: 下の例において、isAlive計算プロパティの値をSchroedingersCat構造体のインスタンス上で変更することは、またそのインスタンスのisDead計算プロパティの値も変更します：

source: In the example below, the \.objectToObserve.myDate key path refers to the myDate property of MyObjectToObserve:
ja: 下の例において、\.objectToObserve.myDateキーパスは、MyObjectToObserveのmyDateプロパティを参照します：

source: In the example, obj has a static type of AnyObject and a dynamic type of IntegerRef.
ja: 例において、objはAnyObjectの静的型とIntegerRefの動的型を持ちます。

source: In the following code, the count variable has the same static and dynamic type: Int.
ja: 以下のコードにおいて、count変数は同じ静的および動的型：Intを持ちます。

source: In the following example, keyPath1 and keyPath2 are equivalent:
ja: 以下の例において、keyPath1とkeyPath2は同等です：

source: In the following example, y is NaN.
ja: 以下の例において、yはNaNです。

source: In the following example, an array of numbers is partitioned by a predicate that matches elements greater than 30.
ja: 次の例において、数からなる配列は、30より大きな要素に合致するという述部によって仕切られます。

source: In the following example, the map(_:) method transforms each Int received from a Counter sequence into a String:
ja: 以下の例において、map(_:)メソッドはCounterシーケンスから受け取った各IntをStringへと変換します：

source: In the following example, the closure provides an ordering for an array of a custom enumeration that describes an HTTP response.
ja: 以下の例では、そのクロージャは、あるHTTP応答を記述するあつらえ列挙の配列に対してある順序付けを提供します。

source: In the following example, the constant y is successfully created from x, an Int instance with a value of 100.
ja: 以下の例において、定数yは、Intインスタンスで100の値を持つxからうまく作成されます

source: In the following example, the constant x is successfully created from a value of 100, while the attempt to initialize the constant y from 1_000 fails because the Int8 type can represent 127 at maximum:
ja: 以下の例において、定数xは100の値から首尾よく作り上げられます、一方で定数yを1_000から初期化する試みは失敗します、なぜならInt8型は最大で127を表現可能だからです：

source: In the following example, the constant x is successfully created from a value of 21.0, while the attempt to initialize the constant y from 21.5 fails:
ja: 続く例において、定数xは21.0の値から首尾よく作成されます、一方で定数yを21.5から初期化する試みは失敗します：

source: In the following example, the difference of 10 and 21 is less than zero, the minimum representable UInt value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と21の差はゼロ、最小限表現可能なUInt値、よりも少ないです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the difference of 10 and 21 is less than zero, the minimum representable UInt value, so the result is the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と21の差はゼロ、最小限表現可能なUInt値、よりも少ないです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the key-value pair for the key "Aquamarine" is removed from the dictionary by assigning nil to the key-based subscript.
ja: 以下の例において、"Aquamarine"に対するキー値ペアは、nilをキー基盤の添え字に割り当てることによって辞書から削除されます。

source: In the following example, the predicate provides an ordering for an array of a custom HTTPResponse type.
ja: 以下の例では、その述部はあつらえのHTTPResponse型の配列に対してある順序付けを提供します。

source: In the following example, the product of 10 and 50 is greater than the maximum representable Int8 value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と50の積は、最大限表現可能なInt8値より大きいです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the result of 21 * 21 is greater than the maximum representable Int8 value:
ja: 以下の例において、21 * 21の結果は、最大限表現可能なInt8値より大きいです：

source: In the following example, the result of 21 + 120 is greater than the maximum representable Int8 value:
ja: 以下の例において、21 + 120の結果は、最大限表現可能なInt8値より大きいです：

source: In the following example, the result of 21 - 50 is less than zero, the minimum representable UInt8 value:
ja: 以下の例において、21 - 50の結果は、最大限表現可能なUInt8値より大きいです：

source: In the following example, the sum of 100 and 121 is greater than the maximum representable Int8 value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、100と121の合計は、最大限表現可能なInt8値より大きいです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the value 127.75 is rounded to 127, which is representable by the Int8 type.
ja: 続く例において、値127.75は127へ丸められます、それはInt8型によって表現可能です。

source: In the implementations above, the Player type uses name and position in both methods.
ja: 上の実装において、Player型はnameとpositionを両方のメソッドにおいて使います。

source: In the next example, y has a value of 21.5, which is encoded as 1.34375 * 2 ** 4.
ja: 次の例において、yは21.5の値を持ちます、それは1.34375 * 2 ** 4のようにエンコードされます。

source: In the umbrella header, import every Objective-C header you want to expose to Swift.
ja: アンブレラヘッダにおいて、あなたが望むあらゆるObjective-CヘッダをインポートすることでSwiftに露出してください。

source: In this case, see the documentation of Collection.underestimatedCount.
ja: この場合には、Collection.underestimatedCountの文書を見てください。

source: In this case, the newly created set drops the duplicate value (“Dave”) and doesn’t maintain the order of the array literal’s elements.
ja: この場合において、新たに作成された集合は、重複した値（「Dave」）を落とします、そして配列リテラルのもつ要素の順番を維持しません。

source: In this case, the values stored in the array are references to objects that live outside the array.
ja: この場合、配列に格納される値らは、その配列の外側で生活しているオブジェクトらへの参照です。

source: In this example, filter(_:) is used to include only names shorter than five characters.
ja: この例において、filter(_:)は５つの文字より短い名前のみ含めるために使われます。

source: In this example, goodNumber is assigned a value of 100 because Int("100") succeeded in returning a non-nil result.
ja: この例において、goodNumberは100の値を割り当てられます、なぜならInt("100")が非nilの結果を返すことに成功したからです。

source: In this example, goodNumber is assigned a value of 100 because Int("100") succeeds in returning a non-nil result.
ja: この例において、goodNumberは100の値を割り当てられます、なぜならInt("100")が非nilの結果を返すことに成功するからです。

source: In this example, lhs tests whether error is an empty string.
ja: この例において、lhsはerrorが空の文字列かどうかテストします。

source: In this example, lhs tests whether measurements.count is greater than zero.
ja: この例において、lhsはmeasurements.countがゼロより大きいかどうかテストします。

source: In this example, map is used first to convert the names in the array to lowercase strings and then to count their characters.
ja: この例では、mapは最初に配列中の名前を小文字文字列に変換するために、それからそれらの文字を数えるために使われます。

source: In this example, x has a value of 21.5, which is stored as 1.34375 * 2**4, where ** is exponentiation.
ja: この例において、xは21.5の値を持ちます、それは1.34375 * 2**4として格納されます、ここで**は冪です。

source: In this example, x is initialized as an Int8 instance by clamping 500 to the range -128...127, and y is initialized as a UInt instance by clamping -500 to the range 0...UInt.max.
ja: この例において、xはInt8インスタンスとして、500を範囲-128...127に制限すること（クランピング）によって初期化されます、そしてyはUIntインスタンスとして、-500を範囲0...UInt.maxに制限することによって初期化されます。

source: In this example, accessing the text property of the smileyType metatype retrieves the overridden value from the EmojiSmiley subclass, instead of the Smiley class’s original definition.
ja: この例において、smileyTypeメタタイプのtextプロパティにアクセスすることは、EmojiSmileyサブクラスからオーバーライドされた値を取って来ます、Smileyクラスのもつ元の定義ではなく。

source: In this example, an array of three ranges is flattened so that the elements of each range can be iterated in turn.
ja: この例において、３つの範囲からなる配列は平坦化されます、それで各範囲の要素は順に反復されることができます。

source: In this example, an asynchronous sequence called Counter produces Int values from 1 to 10.
ja: この例において、Counterと呼ばれる非同期シーケンスはInt値を1から10まで生み出します。

source: In this example, an asynchronous sequence called Counter produces Int values from 1 to 4.
ja: この例において、Counterと呼ばれる非同期シーケンスはInt値を1から4まで生み出します。

source: In this example, an asynchronous sequence called Counter produces Int values from 1 to 5.
ja: この例において、Counterと呼ばれる非同期シーケンスは、Int値を1から5まで生み出します。

source: In this example, both assignments to the printedMessage variable call this Boolean literal initializer behind the scenes.
ja: この例において、printedMessage変数への代入は両方ともこのブールリテラルイニシャライザを舞台裏で呼びます。

source: In this example, note the difference in the result of using map and compactMap with a transformation that returns an optional Int value.
ja: この例において、mapとcompactMapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an array.
ja: この例において、mapとflatMapをある配列を返す変換とともに使うことの結果における違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an optional Int value.
ja: この例において、mapとflatMapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。
